c8220(ivy)_not_consolidated_4core_4iothread/multiplier_100/run4.txt
# run=4/5
# 2026-04-08T21:45:47-06:00

# cmd: taskset -c 5-39 ./bin/sysbench ./share/sysbench/oltp_read_write.lua
           --mysql-host=localhost
           --mysql-port=3306
           --mysql-user=sbuser
           --mysql-password=password
           --mysql-db=sbtest
           --tables=1
           --table_size=100
           --threads=16
           --time=60
           --rand-type=pareto
           --histogram=off
           run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            421946
        write:                           114094
        other:                           57915
        total:                           593955
    transactions:                        27776  (461.89 per sec.)
    queries:                             593955 (9876.91 per sec.)
    ignored errors:                      2363   (39.29 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      461.8887
    time elapsed:                        60.1357s
    total number of events:              27776

Latency (ms):
         min:                                    3.28
         avg:                                   34.59
         max:                                 1178.64
         95th percentile:                      130.13
         sum:                               960735.31

Threads fairness:
    events (avg/stddev):           1736.0000/20.01
    execution time (avg/stddev):   60.0460/0.04